Repository: pypi-data/pypi-mirror-238
Catalog: packages/vula/vula-0.1.16.tar.gz/vula-0.1.16/vula/locale/*/LC_MESSAGES/ui.view.po
Languages: de_de

source: Settings
de_de: Einstellungen

source: Verification Key
de_de: Verifizierungs Schl端ssel

source: Descriptor for
de_de: Deskriptor f端r

source: Remove
de_de: Entfernen

source: Remove this peer:
de_de: Dieses Peer entfernen

source: Edit peer name
de_de: Peer Name editieren

source: Enter new peer name
de_de: Neuen Peer Name eingeben

source: + Add peer
de_de: + Peer hinzuf端gen

source: Important: It may take a few minutes for new peers to be displayed! Enter a verification key:
de_de: Wichtig: Es kann einige Minuten dauern bis neue Peers angezeigt werden! Einen Verifizierungs Schl端ssel eingeben:

source: Enter IP address
de_de: IP Adresse eingeben

source: No peers found
de_de: Keine Peers gefunden

source: Edit name
de_de: Name editieren

source: Pin and verify
de_de: Pinnen und verifizieren
